home/config/doom/config.org
#+PROPERTY: header-args elisp :tangle ./config.el :results silent
#+TITLE: Doom Emacs Config
* Base Settings
** Personal data
Set Name and mail adress
#+begin_src elisp
(setq user-full-name "Tibor Pilz"
      user-mail-address "tibor@pilz.berlin")
#+end_src

** Font settings
#+begin_src elisp
(setq doom-font (font-spec :family "FiraCode Nerd Font" :size 14 :weight 'light)
      doom-big-font (font-spec :family "FiraCode Nerd Font" :size 28 :weight 'normal)
      doom-unicode-font (font-spec :family "FiraCode Nerd Font" :size 14 :weight 'normal)
      doom-variable-pitch-font (font-spec :family "DejaVu Serif" :size 16 :weight 'normal))
#+end_src

** Line numbers
Since I'm using Evil/vim-keybindings, I prefer relative line numbers as default.
#+begin_src elisp
(setq display-line-numbers-type 'relative)
#+end_src

** Tab width
2 spaces, suck it k&r
#+begin_src elisp
(setq tab-width 2)
#+end_src

** Editorconfig
#+begin_src elisp :tangle packages.el
(package! editorconfig)
#+end_src

** Splash Screen
*** Splash Image
I've created a custom SVG with transparency and shadow effects that should go
well with a variety of color schemes.
#+begin_src elisp
(setq fancy-splash-image (concat doom-private-dir "splash-logos/emacs-logo-cutout.svg"))
#+end_src

** Title
I'm setting the title to be just "Emacs"

#+begin_src elisp
(setq frame-title-format "%b - Emacs")
#+end_src
* Utils
For efficiently writing my config, I need some utils.
** Add-Hooks
Small utility to add a function to multiple hooks at once.
#+begin_src elisp
(defun add-hooks (hook-list function)
  "Add FUNCTION to all hooks in HOOK-LIST."
  (dolist (hook hook-list)
    (add-hook hook function)))
#+end_src

* Org Mode
** Base Settings
#+begin_src elisp
(setq org-directory "~/org/")
(setq org-agenda-files (list org-directory))

(setq org-use-property-inheritance t)
(setq org-log-done 'time) ; Log time when task completes
(setq org-list-allow-alphabetical t)       ; a, A, a) A) list bullets)
(setq org-catch-invisible-edits 'smart) ; don't treat lone _ / ^ as sub/superscripts, require _{} / ^{})

(setq org-return-follows-link 1)
(setq calendar-week-start-day 1) ;; start on monday
(setq org-agenda-include-diary t)
#+end_src

** Visual improvements
*** Start Org in mixed-pitch-mode
#+begin_src elisp
(add-hook 'org-mode-hook #'mixed-pitch-mode)
#+end_src

*** Padding
**** Line spacing
Line spacing should be higher in org-mode than in "code" modes. So I'll define a
function first to set the spacing, and then call it with different values in the
respective hooks
#+begin_src elisp
(defun set-line-spacing (size)
  "Set line spacing"
  (setq line-spacing size))
#+end_src

For org-mode, I'm going with a higher value of 0.2.
#+begin_src elisp
(add-hook 'org-mode-hook
          (lambda () (set-line-spacing 0.2)))
#+end_src

*** TODO Fix this - Center text
Olivetti is a minor mode for centering the text in a buffer.

Sadly, when opening i.e. this ~org~ file or a random small ~ts~ file, this no
longer works.

#+begin_src elisp :tangle packages.el
(package! olivetti)
#+end_src

*** Improve Headlines
**** Hide leading stars
#+begin_src elisp
(setq org-hide-leading-stars t)
#+end_src

How can I show the leading stars for the currently selected headline?

**** Indent content based on headline level
#+begin_src elisp
(setq org-startup-indented t)
#+end_src

*** Use Org-Modern
Org-modern (https://github.com/minad/org-modern) contains a lot of nice visual
improvements for org-mode.

This is the most basic setup:

#+begin_src elisp :tangle packages.el
(package! org-modern)
#+end_src

#+begin_src elisp
(use-package! org-modern
  :hook (org-mode . global-org-modern-mode)
  :config
  (setq org-modern-label-border 0.4))
#+end_src

Set up org-modern

#+begin_src elisp
(setq
  org-auto-align-tags nil
  org-tags-column 0
  org-catch-invisible-edits 'show-and-error
  org-special-ctrl-a/e t
  org-insert-heading-respect-content t

  ;; Org styling, hide markup etc
  org-hide-emphasis-markers t
  org-pretty-entities t
  org-ellipsis "..."

  ;; Agenda styling
  org-agenda-tags-column 0
  org-agenda-block-separator ?─
  org-agenda-time-grid
  '((daily today require-timed)
    (800 1000 1200 1400 1600 1800 2000)
    " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
  org-agenda-current-time-string
  "⭠ now ─────────────────────────────────────────────────")

(global-org-modern-mode)
#+end_src

Though the author has more examples for theming in theriy README.
**** TODO actually implement this :emacs:
Currently, this has some issues with doom emacs.

(I Need to adjust the style to fit into my theme)

Use it globally and tweak it some more.
#+begin_src elisp :tangle none
;; (modify-all-frames-parameters
;;  '((right-divider-width . 10)
;;    (internal-border-width . 10)))
;; (dolist (face '(window-divider
;;                 window-divider-first-pixel
;;                 window-divider-last-pixel))
;;   (face-spec-reset-face face)
;;   (set-face-foreground face (face-attribute 'default :background)))
;; (set-face-background 'fringe (face-attribute 'default :background))

;; (use-package! org-modern
;;   :after org
;;   :custom
;;   (org-modern-star '("◉" "○" "◈" "◇" "•"))
;;   (org-modern-timestamp '(" %d.%m.%Y " . " %H:%M ")))

;; (setq
;;  ;; Edit settings
;;  org-auto-align-tags nil
;;  org-tags-column 0
;;  org-catch-invisible-edits 'show-and-error
;;  org-special-ctrl-a/e t
;;  org-insert-heading-respect-content t

;;  ;; Org styling, hide markup etc.
;;  org-hide-emphasis-markers t
;;  org-pretty-entities t
;;  org-ellipsis "…"

;;  ;; Agenda styling
;;  org-agenda-tags-column 0
;;  org-agenda-block-separator ?─
;;  org-agenda-time-grid
;;  '((daily today require-timed)
;;    (800 1000 1200 1400 1600 1800 2000)
;;    " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
;;  org-agenda-current-time-string
;;  "⭠ now ─────────────────────────────────────────────────")

;; (global-org-modern-mode)
#+end_src

*** Vastly improve the tree's display
#+begin_src elisp
(setq neo-theme (if (display-graphic-p) 'icons 'arrow))
#+end_src

*** Miscellanious improvements
**** Show passed deadlines as error
#+begin_src elisp
(setq org-agenda-deadline-faces
      '((1.001 . error)
        (1.0 . org-warning)
        (0.5 . org-upcoming-deadline)
        (0.0 . org-upcoming-distant-deadline)))
#+end_src

**** Show quote blocks in italic
#+begin_src elisp
(setq org-fontify-quote-and-verse-blocks t)
#+end_src

**** Defer font-lock
For a more responsive editing experience
#+begin_src elisp
(defun locally-defer-font-lock ()
  "Set jit-lock defer and stealth, when buffer is over a certain size."
  (when (> (buffer-size) 50000)
    (setq-local jit-lock-defer-time 0.05
                jit-lock-stealth-time 1)))
#+end_src

** Babel
*** HTTP requests via babel
#+begin_src elisp
(use-package! ob-http
  :commands org-babel-execute:http)
#+end_src

*** Babel header args
See https://org-babel.readthedocs.io/en/latest/header-args/

#+begin_src elisp
(setq org-babel-default-header-args
      '((:session . "none")
        (:results . "replace")
        (:exports . "code")
        (:cache . "no")
        (:noeweb . "no")
        (:hlines . "no")
        (:tangle . "no")
        (:comments . "link")))
#+end_src

*** Auto-Tangling
I want org to tangle my config.org on file save, regardless whether it's the one
loaded or in a different repo.

#+begin_src elisp
(defun org-babel-tangle-config ()
  (when (string-equal (file-name-nondirectory (buffer-file-name))
                      "config.org")
    (let ((org-config-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook
          (lambda ()
            (add-hook 'after-save-hook #'org-babel-tangle-config)))
#+end_src

** Import/Export
*** View exported file
#+begin_src elisp
(map! :map org-mode-map
      :localleader
      :desc "View exported file" "v" #'org-view-output-file)

(defun org-view-output-file (&optional org-file-path)
  "Visit buffer open on the first output file (if any) found, using `org-view-output-file-extensions'"
  (interactive)
  (let* ((org-file-path (or org-file-path (buffer-file-name) ""))
         (dir (file-name-directory org-file-path))
         (basename (file-name-base org-file-path))
         (output-file nil))
    (dolist (ext org-view-output-file-extensions)
      (unless output-file
        (when (file-exists-p
               (concat dir basename "." ext))
          (setq output-file (concat dir basename "." ext)))))
    (if output-file
        (if (member (file-name-extension output-file) org-view-external-file-extensions)
            (browse-url-xdg-open output-file)
          (pop-to-buffer (or (find-buffer-visiting output-file)
                             (find-file-noselect output-file))))
      (message "No exported file found"))))

(defvar org-view-output-file-extensions '("pdf" "md" "rst" "txt" "tex" "html")
  "Search for output files with these extensions, in order, viewing the first that matches")
(defvar org-view-external-file-extensions '("html")
  "File formats that should be opened externally.")

#+end_src

*** use github markdown
#+begin_src elisp
(use-package! ox-gfm :after ox :defer t)
#+end_src

*** Export headings up to five levels deep
#+begin_src elisp
(setq org-export-headline-levels 5)
#+end_src

*** automatic latex rendering
#+begin_src elisp :tangle packages.el
(package! org-fragtog)
#+end_src

#+begin_src elisp :tangle none
(use-package! org-fragtog
  :hook (org-mode . 'org-fragtog-mode))
#+end_src

*** Latex fragments
#+begin_src elisp
(setq org-highlight-latex-and-related '(native script entities))
#+end_src

** Extensions
*** Roam
**** Use the same directory as org
#+begin_src elisp
(setq org-roam-directory "~/org/roam")
#+end_src

**** Add Org-Roam UI
Org-Roam UI is a web-based interface for Org-roam. It is a separate package -
and it also needs the websocket package as dependency.

The closest comparison to org-roam-ui is Obsidian.

#+begin_src elisp :tangle packages.el
(unpin! org-roam)
(package! org-roam-ui)
(package! websocket) ; dependency of `org-roam-ui'
#+end_src

#+begin_src elisp
(use-package! websocket
  :after org-roam
  :defer t)

(use-package! org-roam-ui
  :after org-roam
  :config
  (setq org-roam-ui-synch-theme t
        org-roam-ui-follow t
        org-roam-ui-update-on-save t
        org-roam-ui-open-on-start t))
#+end_src

** Fixes and miscellanious improvements
