home/config/doom/config.org
*** Base 16 Themes
Since they rely on only the 16 base terminal colors, base 16 themes are very
popular and make it easy to have a harmonized look across all your programs.
Fortunately, there is a base 16 theme for Doom Emacs, which stems from the
"Tinted Themeing project" (https://github.com/tinted-theming/home).

#+begin_src elisp :tangle packages.el
(package! base16-theme)
#+end_src

Some of the themes have a bit too less contrast for my taste. I think  the issue
is that all 16 colors are taken 'as-is', whereas it should be possible to
create a color scheme with more nuance via color correcting the applied colors.

~kurecolor~ seems to be a library aimed exactly at such a purpose.

#+begin_src elisp :tangle packages.el
(package! kurecolor)
#+end_src

**** TODO: Implement more complex color schemes based on base16 colors

** Modeline
*** Doom Modeline
Allow for more characters in the branch name
#+begin_src elisp
(setq doom-modeline-vcs-max-length 50)
#+end_src

#+begin_src elisp
(setq doom-modeline-hud t)
#+end_src

Disable additional unnecessary information
#+begin_src elisp
(setq doom-modeline-buffer-encoding nil)
(setq doom-modeline-modal nil)
(setq doom-modeline-column-format "")
(setq size-indication-mode nil)
#+end_src
** UI
*** General Padding
The way windows have been close together always kind of botheres me. Luckily,
there's a package that seems to halp with simple padding, without any
contortions.

#+begin_src elisp :tangle packages.el
(package! spacious-padding)
#+end_src

To actually use it, I need to find a better color scheme, where the edges aren't
as jarring, but it's very promising. The individual spacings can be adjusted
with the following:

#+begin_src elisp
(use-package! spacious-padding
  :config
  (setq spacious-padding-width '(
    :internal-border-width 15
    :header-line-width 4
    :mode-line-width 6
    :tab-width 8
    :right-divider-width 30
    :scroll-bar-width 8)))
#+end_src

Furthermore, there's a "subtle mode line setting", Which subdues the modelines a
bit. There's the possibility to target individual faces of the modelines and
change them based on whether they're active or not  - but I'm content with just
setting the modeline to have the window's background color.

#+begin_src elisp
(setq spacious-padding-subtle-mode-line t)
#+end_src

Now that everything's set up, I'm enabling the mode.

#+begin_src elisp
(spacious-padding-mode 1)
#+end_src

(The actual values obviously need to be tweaked though)

** Ivy
Ivy is a package that provides a completion framework for Emacs. It is
particularly useful for commands that require a lot of input, such as ~M-x~ or
~find-file~.

It is fast and leightweight, and there are a lot of packages that integrate with
it.

*** Keybindings

Some of the default keybindings feel odd to me, for instance the tab key
behavior. I'm still trying for a way to have the same behavior as in a terminal,
i.e. multiple tab presses start cycling through the completion candidates.

#+begin_src elisp
;; (define-key ivy-minibuffer-map (kbd "TAB") 'ivy-partial)
;; (define-key ivy-minibuffer-map (kbd "<return>") 'ivy-alt-done)
#+end_src

*** Looks
**** All-The-Icons Ivy Rich

Per default, Ivy looks a little bland. All-The-Icons-Ivy Richt is an alternative
to All-The-icons-Ivy (which had some issues with my setup)


#+begin_src elisp :tangle packages.el
(package! all-the-icons-ivy-rich)
#+end_src

#+begin_src elisp
(use-package! all-the-icons-ivy-rich
  :defer t
  :after counsel-projectile
  :init (all-the-icons-ivy-rich-mode +1)
  :config
  (setq all-the-icons-ivy-rich-icon-size 0.8))
#+end_src

**** Ivy-Postframe
:LOGBOOK:
CLOCK: [2023-02-10 Fri 12:39]--[2023-02-10 Fri 12:41] =>  0:02
:END:

Doom Emacs already has Ivy-Postframe enabled, so there are just some tweaks to
be made.

Per default, the window has a dynamic width, which means that when typing, it
will rapidly change its width, which is not very pleasant to look at.
#+begin_src elisp
(setq ivy-posframe-width 80)
#+end_src

** Treemacs

Treemacs is a file and project explorer similar to NeoTree or vim’s
NerdTree, but largely inspired by the Project Explorer in Eclipse.
It shows the file system outlines of your projects in a simple tree layout
allowing quick navigation
and exploration, while also possessing basic file management utilities.

*** Icons
Doom switched from ~treemacs-all-the-icons~ to ~treemacs-nerd-icons~ recently -
though the icons look weird per default. For some reason, the fix discussed [[https://discourse.doomemacs.org/t/ugly-icons-in-treemacs/4147][here]] does not work, so I'm applying it manually.

#+begin_src elisp :tangle packages.el
(package! treemacs-nerd-icons :pin "9876cb478145a0ec4e36f64ff6583f3de7126216")
#+end_src

#+begin_src elisp
(use-package! treemacs-nerd-icons
  :after treemacs
  :config (treemacs-load-theme "nerd-icons"))
#+end_src

**** Inconsistent directory icons

Some directory icons are inconsistent, more discussion here:
https://github.com/Alexander-Miller/treemacs/issues/1016

There's a fix outlined in the GH issues, which I'm applying manually.

*** Modeline
I don't really need the modeline in the treemacs buffer, so I'm disabling it.

#+begin_src elisp
(add-hook 'treemacs-mode-hook #'hide-mode-line-mode)
#+end_src
** Vertico
Prefix the current candidate with an arrow
#+begin_src elisp
(defun minibuffer-format-candidate (orig cand prefix suffix index _start)
  (let ((prefix (if (= vertico--index index)
                    " > " "   ")))
    (funcall orig cand prefix suffix index _start)))

(advice-add #'vertico--format-candidate
            :around #'minibuffer-format-candidate)
#+end_src

Don't show results count
#+begin_src elisp
(setq vertico-count-format nil)
#+end_src

Make vertico-posframe a little wider
#+begin_src elisp
(setq vertico-posframe-width 200)
#+end_src

Add fringe to vertico-posframea
#+begin_src elisp
(setq vertico-posframe-parameters
      '((left-fringe . 16)
        (right-fringe . 8)
        (border-width . 16)))
#+end_src

** Xwidget Webkit
*** Emacs xwidget-webkit enhancement suite

Xwwp (https://github.com/BlueFlo0d/xwwp) is a package that enhances the
xwidget-webkit browser.

#+begin_src elisp :tangle packages.el
(package! xwwp :recipe (:host github :repo "BlueFlo0d/xwwp"))
(package! xwwp-follow-link-ivy)
(package! ctable)
#+end_src

#+begin_src elisp
(use-package! xwwp-full
  :after xwidget-webkit
  :custom
  (xwwp-follow-link-completion-system 'ivy)
  :bind (:map xwidget-webkit-mode-map
              ("f" . xwwp-ace-toggle)
              ("v" . xwwp-follow-link)))
#+end_src
** Kubernetes
~kubernetes-mode~ brings a lot of snippets.

#+begin_src elisp :tangle packages.el
(package! k8s-mode)
#+end_src

* Performance
Various tweaks to improve the overall performance.
** Raise the GC-Cons threshold
#+begin_example elisp
(setq gc-cons-threshold (* 1024 1024 1024)) ;; 1G
#+end_example

** Increase the amount of data which Emacs reads from the process
#+begin_src elisp
(setq read-process-output-max (* 4 1024 1024)) ;; 4mb
#+end_src

** Ignore JSONRPC logs
#+begin_src elisp
(fset #'jsonrpc--log-event #'ignore)
#+end_src
* Unsorted Packages
** Discord Presence
#+begin_src elisp :tangle packages.el
(package! elcord)
#+end_src

#+begin_src elisp
(use-package! elcord
  :config
  (setq elcord-editor-icon "emacs_icon"))
#+end_src
** Misc
#+begin_src elisp :tangle packages.el

(package! dap-mode)

;; HTTP requests via babel
(package! ob-http :pin "b1428ea2a63bcb510e7382a1bf5fe82b19c104a7")
#+end_src
